In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
# Let's create a dframe to work with (Highest elevation cities in USA)
dframe = DataFrame({'city':['Alma','Brian Head','Fox Park'],
                    'altitude':[3158,3000,2762]})
#convert each dictionary in a column
#now we have 2 columns: city; altitude

In [4]:
dframe

         city  altitude
0        Alma      3158
1  Brian Head      3000
2    Fox Park      2762

In [5]:
#Now let's say we wanted to add a column for the States, we can do that with a mapping.
#create a dictionary called "state_map"
state_map={'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming'}

In [6]:
# Now we can map that data to our current dframe

#call dframe. Create a column "state" in that dframe. 
#Call the city column and pass the method .map(); map to it the dictionary called state_map
#map a new dictionary to a column already existing in the dataframe

dframe['state']=dframe['city'].map(state_map)

In [7]:
dframe

         city  altitude     state
0        Alma      3158  Colorado
1  Brian Head      3000      Utah
2    Fox Park      2762   Wyoming

In [ ]:
# Mapping is a great way to do element-wise transfomations and other data cleaning operations!
In [ ]: